<?php
session_start();
?>

<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/strict.dtd">
<html>

<head>
    <link href="//maxcdn.bootstrapcdn.com/bootstrap/4.0.0/css/bootstrap.min.css" rel="stylesheet" id="bootstrap-css">
    <script src="//maxcdn.bootstrapcdn.com/bootstrap/4.0.0/js/bootstrap.min.js"></script>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.2.1/jquery.min.js"></script>
    <script src="//ajax.googleapis.com/ajax/libs/jquery/1.11.0/jquery.min.js"></script>
    <script src="//netdna.bootstrapcdn.com/bootstrap/3.1.1/js/bootstrap.min.js"></script>
    <link rel="stylesheet" type="text/css" href="//netdna.bootstrapcdn.com/bootstrap/3.1.1/css/bootstrap.min.css">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css">
    <script src='https://kit.fontawesome.com/a076d05399.js' crossorigin='anonymous'></script>

    <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
    <link rel="stylesheet" href="search.css">




</head>

<body>
    <div class="bg-image"></div>
    <div id="content">
        Менюто за навигация е във всяка страница, в която потребителят може да влезе. Менюто съдържа следните елементи:
        <br>
        • Лого на сайта
        <br>
        • Начало - хипервръзка, която извежда потребителя до началния екран
        <br>
        • Относно- хипервръзка, която извежда потребителя до началния екран
        <br>
        • Последни заглавия - хипервръзка, която извежда потребителя до страницата с последни заглавия
        <br>
        • Влизане/ Излизане - хипервръзка, която извежда потребителя до страницата за вход
        <br>
        Ако потребителят е регистриран и е влязъл в своят профил вляво ще се появи бутон “Избор на фон”. Чрез него потребителят може да избира фона на сайта.

        Търсещата машина присъства във всяка една страница и служи за търсене на книги. Под нея са поставен бутоните за сортиране. Отдясно на търсачката се намира помощната страница, в която има съдържание за това как се работи със системата.
        <img src="1.jpg">
        <br>
        Когато зададете своите предпочитания за търсене, ще се появят резултатите. Всеки потребител, независимо от това дали е регистриран или не, има право да търси заглавия по свой избор. Регистрираните потребители имат право да променят изгледа на извеждане на резултатите. Това става чрез избора на един от двата бутона над секцията. В единият случай резултатите се появяват в стил решетка, като за всяко заглавие се показва неговата обложка, заглавие, както и неговия автор. Другият бутон извежда заглавията в изглед на списък, където се показва по- подробна информация за книгата(заглавие, автор, тип на продукта, година на издаване, име на издателства, брой страници, жанр, тагове).
        <img src="2.jpg">
        <br>
        Най- отгоре се появява общия рейтинг. Чрез натискане на зведичките се поставя рейтинг на книгата. След това в поле “Заглавие” може да се въведе заглавието на коментара. В полето “Коментар” потребителят въвежда коментара и след това натиска бутона “Добави коментар”. Коментарът може да бъде отказан чрез бутона “Откажи”. Под бутоните се появяват коментарите и рейтингите на потребителите, както и датата на тяхното създаване. Ако потребителят има администраторски права, под всеки коментар се появява бутон, чрез който може да се дадения коментар.
        <br>
        <img src="3.jpg">
</body>

</html>